def @main(%aux: Tensor[(1, 102), float32] /* ty=Tensor[(1, 102), float32] span=StatefulPartitionedCall/pump_predictive_model_1/aux_norm_1/moments/mean.aux:0:0 */, %spec: Tensor[(1, 128, 128, 1), float32] /* ty=Tensor[(1, 128, 128, 1), float32] span=StatefulPartitionedCall/pump_predictive_model_1/bn1_1_1/batchnorm/mul_1__12.spec:0:0 */) -> (Tensor[(1, 16), float32], Tensor[(1, 4), float32], Tensor[(1, 1), float32], Tensor[(1, 1), float32]) {
  %0 = transpose(%spec, axes=[0, 3, 1, 2]) /* ty=Tensor[(1, 1, 128, 128), float32] span=StatefulPartitionedCall/pump_predictive_model_1/bn1_1_1/batchnorm/mul_1__12:0:0 */;
  %1 = nn.conv2d(%0, meta[relay.Constant][0] /* ty=Tensor[(32, 1, 3, 3), float32] span=Conv__49.StatefulPartitionedCall/pump_predictive_model_1/conv1_1_1/convolution/merged_input:0:0:0 */, padding=[1, 1, 1, 1], channels=32, kernel_size=[3, 3]) /* ty=Tensor[(1, 32, 128, 128), float32] span=Conv__49:0:0 */;
  %2 = nn.bias_add(%1, meta[relay.Constant][1] /* ty=Tensor[(32), float32] span=Conv__49.StatefulPartitionedCall/pump_predictive_model_1/bn1_1_1/batchnorm/sub:0:0:0 */) /* ty=Tensor[(1, 32, 128, 128), float32] span=Conv__49:0:0 */;
  %3 = nn.relu(%2) /* ty=Tensor[(1, 32, 128, 128), float32] span=StatefulPartitionedCall/pump_predictive_model_1/activation_1/Relu:0:0 */;
  %4 = nn.conv2d(%3, meta[relay.Constant][2] /* ty=Tensor[(32, 32, 3, 3), float32] span=Conv__51.StatefulPartitionedCall/pump_predictive_model_1/conv1_2_1/convolution/merged_input:0:0:0 */, padding=[1, 1, 1, 1], channels=32, kernel_size=[3, 3]) /* ty=Tensor[(1, 32, 128, 128), float32] span=Conv__51:0:0 */;
  %5 = nn.bias_add(%4, meta[relay.Constant][3] /* ty=Tensor[(32), float32] span=Conv__51.StatefulPartitionedCall/pump_predictive_model_1/bn1_2_1/batchnorm/sub:0:0:0 */) /* ty=Tensor[(1, 32, 128, 128), float32] span=Conv__51:0:0 */;
  %6 = nn.relu(%5) /* ty=Tensor[(1, 32, 128, 128), float32] span=StatefulPartitionedCall/pump_predictive_model_1/activation_1_2/Relu:0:0 */;
  %7 = nn.max_pool2d(%6, pool_size=[2, 2], strides=[2, 2], padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 32, 64, 64), float32] span=StatefulPartitionedCall/pump_predictive_model_1/pool1_1/MaxPool2d:0:0 */;
  %8 = nn.conv2d(%7, meta[relay.Constant][4] /* ty=Tensor[(64, 32, 3, 3), float32] span=Conv__53.StatefulPartitionedCall/pump_predictive_model_1/conv2_1_1/convolution/merged_input:0:0:0 */, padding=[1, 1, 1, 1], channels=64, kernel_size=[3, 3]) /* ty=Tensor[(1, 64, 64, 64), float32] span=Conv__53:0:0 */;
  %9 = nn.bias_add(%8, meta[relay.Constant][5] /* ty=Tensor[(64), float32] span=Conv__53.StatefulPartitionedCall/pump_predictive_model_1/bn2_1_1/batchnorm/sub:0:0:0 */) /* ty=Tensor[(1, 64, 64, 64), float32] span=Conv__53:0:0 */;
  %10 = nn.relu(%9) /* ty=Tensor[(1, 64, 64, 64), float32] span=StatefulPartitionedCall/pump_predictive_model_1/activation_2_1/Relu:0:0 */;
  %11 = nn.conv2d(%10, meta[relay.Constant][6] /* ty=Tensor[(64, 64, 3, 3), float32] span=Conv__55.StatefulPartitionedCall/pump_predictive_model_1/conv2_2_1/convolution/merged_input:0:0:0 */, padding=[1, 1, 1, 1], channels=64, kernel_size=[3, 3]) /* ty=Tensor[(1, 64, 64, 64), float32] span=Conv__55:0:0 */;
  %12 = nn.bias_add(%11, meta[relay.Constant][7] /* ty=Tensor[(64), float32] span=Conv__55.StatefulPartitionedCall/pump_predictive_model_1/bn2_2_1/batchnorm/sub:0:0:0 */) /* ty=Tensor[(1, 64, 64, 64), float32] span=Conv__55:0:0 */;
  %13 = nn.relu(%12) /* ty=Tensor[(1, 64, 64, 64), float32] span=StatefulPartitionedCall/pump_predictive_model_1/activation_3_1/Relu:0:0 */;
  %14 = nn.max_pool2d(%13, pool_size=[2, 2], strides=[2, 2], padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 64, 32, 32), float32] span=StatefulPartitionedCall/pump_predictive_model_1/pool2_1/MaxPool2d:0:0 */;
  %15 = nn.conv2d(%14, meta[relay.Constant][8] /* ty=Tensor[(128, 64, 3, 3), float32] span=Conv__57.StatefulPartitionedCall/pump_predictive_model_1/conv3_1_1/convolution/merged_input:0:0:0 */, padding=[1, 1, 1, 1], channels=128, kernel_size=[3, 3]) /* ty=Tensor[(1, 128, 32, 32), float32] span=Conv__57:0:0 */;
  %16 = nn.bias_add(%15, meta[relay.Constant][9] /* ty=Tensor[(128), float32] span=Conv__57.StatefulPartitionedCall/pump_predictive_model_1/bn3_1_1/batchnorm/sub:0:0:0 */) /* ty=Tensor[(1, 128, 32, 32), float32] span=Conv__57:0:0 */;
  %17 = nn.relu(%16) /* ty=Tensor[(1, 128, 32, 32), float32] span=StatefulPartitionedCall/pump_predictive_model_1/activation_4_1/Relu:0:0 */;
  %18 = nn.conv2d(%17, meta[relay.Constant][10] /* ty=Tensor[(128, 128, 3, 3), float32] span=Conv__59.StatefulPartitionedCall/pump_predictive_model_1/conv3_2_1/convolution/merged_input:0:0:0 */, padding=[1, 1, 1, 1], channels=128, kernel_size=[3, 3]) /* ty=Tensor[(1, 128, 32, 32), float32] span=Conv__59:0:0 */;
  %19 = nn.bias_add(%18, meta[relay.Constant][11] /* ty=Tensor[(128), float32] span=Conv__59.StatefulPartitionedCall/pump_predictive_model_1/bn3_2_1/batchnorm/sub:0:0:0 */) /* ty=Tensor[(1, 128, 32, 32), float32] span=Conv__59:0:0 */;
  %20 = nn.relu(%19) /* ty=Tensor[(1, 128, 32, 32), float32] span=StatefulPartitionedCall/pump_predictive_model_1/activation_5_1/Relu:0:0 */;
  %21 = nn.global_avg_pool2d(%20) /* ty=Tensor[(1, 128, 1, 1), float32] span=StatefulPartitionedCall/pump_predictive_model_1/cnn_features_1/Mean:0:0 */;
  %22 = mean(%aux, axis=[1], keepdims=True) /* ty=Tensor[(1, 1), float32] span=StatefulPartitionedCall/pump_predictive_model_1/aux_norm_1/moments/mean:0:0 */;
  %23 = subtract(%aux, %22) /* ty=Tensor[(1, 102), float32] span=StatefulPartitionedCall/pump_predictive_model_1/aux_norm_1/moments/SquaredDifference:0:0 */;
  %24 = multiply(%23, %23) /* ty=Tensor[(1, 102), float32] span=StatefulPartitionedCall/pump_predictive_model_1/aux_norm_1/moments/SquaredDifference__16:0:0 */;
  %25 = mean(%24, axis=[1], keepdims=True) /* ty=Tensor[(1, 1), float32] span=StatefulPartitionedCall/pump_predictive_model_1/aux_norm_1/moments/variance:0:0 */;
  %26 = add(%25, 0.001f /* ty=float32 span=StatefulPartitionedCall/pump_predictive_model_1/aux_norm_1/add.StatefulPartitionedCall/pump_predictive_model_1/aux_norm_1/add/y:0:0:0 */) /* ty=Tensor[(1, 1), float32] span=StatefulPartitionedCall/pump_predictive_model_1/aux_norm_1/add:0:0 */;
  %27 = sqrt(%26) /* ty=Tensor[(1, 1), float32] span=StatefulPartitionedCall/pump_predictive_model_1/aux_norm_1/Rsqrt:0:0 */;
  %28 = divide(1f /* ty=float32 span=StatefulPartitionedCall/pump_predictive_model_1/aux_norm_1/Rsqrt__19:0:0 */, %27) /* ty=Tensor[(1, 1), float32] span=StatefulPartitionedCall/pump_predictive_model_1/aux_norm_1/Rsqrt__19:0:0 */;
  %29 = multiply(%28, meta[relay.Constant][12] /* ty=Tensor[(1, 102), float32] span=StatefulPartitionedCall/pump_predictive_model_1/aux_norm_1/mul.StatefulPartitionedCall/pump_predictive_model_1/aux_norm_1/Reshape:0:0:0 */) /* ty=Tensor[(1, 102), float32] span=StatefulPartitionedCall/pump_predictive_model_1/aux_norm_1/mul:0:0 */;
  %30 = negative(%22) /* ty=Tensor[(1, 1), float32] span=StatefulPartitionedCall/pump_predictive_model_1/aux_norm_1/Neg:0:0 */;
  %31 = multiply(%30, %29) /* ty=Tensor[(1, 102), float32] span=StatefulPartitionedCall/pump_predictive_model_1/aux_norm_1/mul_1:0:0 */;
  %32 = multiply(%aux, %29) /* ty=Tensor[(1, 102), float32] span=StatefulPartitionedCall/pump_predictive_model_1/aux_norm_1/mul_2:0:0 */;
  %33 = add(%31, meta[relay.Constant][13] /* ty=Tensor[(1, 102), float32] span=StatefulPartitionedCall/pump_predictive_model_1/aux_norm_1/add_1.StatefulPartitionedCall/pump_predictive_model_1/aux_norm_1/Reshape_1:0:0:0 */) /* ty=Tensor[(1, 102), float32] span=StatefulPartitionedCall/pump_predictive_model_1/aux_norm_1/add_1:0:0 */;
  %34 = add(%32, %33) /* ty=Tensor[(1, 102), float32] span=StatefulPartitionedCall/pump_predictive_model_1/aux_norm_1/add_2:0:0 */;
  %35 = nn.dense(%34, meta[relay.Constant][14] /* ty=Tensor[(128, 102), float32] span=StatefulPartitionedCall/pump_predictive_model_1/aux_dense1_1/MatMul:0:0 */, units=None, out_dtype="float32") /* ty=Tensor[(1, 128), float32] span=StatefulPartitionedCall/pump_predictive_model_1/aux_dense1_1/MatMul:0:0 */;
  %36 = add(%35, meta[relay.Constant][15] /* ty=Tensor[(128), float32] span=StatefulPartitionedCall/pump_predictive_model_1/aux_dense1_1/BiasAdd.StatefulPartitionedCall/pump_predictive_model_1/aux_dense1_1/BiasAdd/ReadVariableOp:0:0:0 */) /* ty=Tensor[(1, 128), float32] span=StatefulPartitionedCall/pump_predictive_model_1/aux_dense1_1/BiasAdd:0:0 */;
  %37 = nn.relu(%36) /* ty=Tensor[(1, 128), float32] span=StatefulPartitionedCall/pump_predictive_model_1/aux_dense1_1/Relu:0:0 */;
  %38 = nn.dense(%37, meta[relay.Constant][16] /* ty=Tensor[(128, 128), float32] span=StatefulPartitionedCall/pump_predictive_model_1/aux_dense2_1/MatMul:0:0 */, units=None, out_dtype="float32") /* ty=Tensor[(1, 128), float32] span=StatefulPartitionedCall/pump_predictive_model_1/aux_dense2_1/MatMul:0:0 */;
  %39 = add(%38, meta[relay.Constant][17] /* ty=Tensor[(128), float32] span=StatefulPartitionedCall/pump_predictive_model_1/aux_dense2_1/BiasAdd.StatefulPartitionedCall/pump_predictive_model_1/aux_dense2_1/BiasAdd/ReadVariableOp:0:0:0 */) /* ty=Tensor[(1, 128), float32] span=StatefulPartitionedCall/pump_predictive_model_1/aux_dense2_1/BiasAdd:0:0 */;
  %40 = squeeze(%21, axis=[2, 3]) /* ty=Tensor[(1, 128), float32] span=StatefulPartitionedCall/pump_predictive_model_1/cnn_features_1/Mean_Squeeze__63:0:0 */;
  %41 = nn.relu(%39) /* ty=Tensor[(1, 128), float32] span=StatefulPartitionedCall/pump_predictive_model_1/aux_dense2_1/Relu:0:0 */;
  %42 = (%40, %41) /* ty=(Tensor[(1, 128), float32], Tensor[(1, 128), float32]) span=StatefulPartitionedCall/pump_predictive_model_1/shared_embedding_1/concat:0:0 */;
  %43 = concatenate(%42, axis=1) /* ty=Tensor[(1, 256), float32] span=StatefulPartitionedCall/pump_predictive_model_1/shared_embedding_1/concat:0:0 */;
  %44 = nn.dense(%43, meta[relay.Constant][18] /* ty=Tensor[(256, 256), float32] span=StatefulPartitionedCall/pump_predictive_model_1/shared_dense1_1/MatMul:0:0 */, units=None, out_dtype="float32") /* ty=Tensor[(1, 256), float32] span=StatefulPartitionedCall/pump_predictive_model_1/shared_dense1_1/MatMul:0:0 */;
  %45 = add(%44, meta[relay.Constant][19] /* ty=Tensor[(256), float32] span=StatefulPartitionedCall/pump_predictive_model_1/shared_dense1_1/BiasAdd.StatefulPartitionedCall/pump_predictive_model_1/shared_dense1_1/BiasAdd/ReadVariableOp:0:0:0 */) /* ty=Tensor[(1, 256), float32] span=StatefulPartitionedCall/pump_predictive_model_1/shared_dense1_1/BiasAdd:0:0 */;
  %46 = nn.relu(%45) /* ty=Tensor[(1, 256), float32] span=StatefulPartitionedCall/pump_predictive_model_1/shared_dense1_1/Relu:0:0 */;
  %47 = nn.dense(%46, meta[relay.Constant][20] /* ty=Tensor[(128, 256), float32] span=StatefulPartitionedCall/pump_predictive_model_1/shared_dense2_1/MatMul:0:0 */, units=None, out_dtype="float32") /* ty=Tensor[(1, 128), float32] span=StatefulPartitionedCall/pump_predictive_model_1/shared_dense2_1/MatMul:0:0 */;
  %48 = add(%47, meta[relay.Constant][21] /* ty=Tensor[(128), float32] span=StatefulPartitionedCall/pump_predictive_model_1/shared_dense2_1/BiasAdd.StatefulPartitionedCall/pump_predictive_model_1/shared_dense2_1/BiasAdd/ReadVariableOp:0:0:0 */) /* ty=Tensor[(1, 128), float32] span=StatefulPartitionedCall/pump_predictive_model_1/shared_dense2_1/BiasAdd:0:0 */;
  %49 = nn.relu(%48) /* ty=Tensor[(1, 128), float32] span=StatefulPartitionedCall/pump_predictive_model_1/shared_dense2_1/Relu:0:0 */;
  %50 = nn.dense(%49, meta[relay.Constant][22] /* ty=Tensor[(128, 128), float32] span=StatefulPartitionedCall/pump_predictive_model_1/mode_dense_1/MatMul:0:0 */, units=None, out_dtype="float32") /* ty=Tensor[(1, 128), float32] span=StatefulPartitionedCall/pump_predictive_model_1/mode_dense_1/MatMul:0:0 */;
  %51 = add(%50, meta[relay.Constant][23] /* ty=Tensor[(128), float32] span=StatefulPartitionedCall/pump_predictive_model_1/mode_dense_1/BiasAdd.StatefulPartitionedCall/pump_predictive_model_1/mode_dense_1/BiasAdd/ReadVariableOp:0:0:0 */) /* ty=Tensor[(1, 128), float32] span=StatefulPartitionedCall/pump_predictive_model_1/mode_dense_1/BiasAdd:0:0 */;
  %52 = nn.relu(%51) /* ty=Tensor[(1, 128), float32] span=StatefulPartitionedCall/pump_predictive_model_1/mode_dense_1/Relu:0:0 */;
  %53 = nn.dense(%52, meta[relay.Constant][24] /* ty=Tensor[(16, 128), float32] span=StatefulPartitionedCall/pump_predictive_model_1/mode_1/MatMul:0:0 */, units=None, out_dtype="float32") /* ty=Tensor[(1, 16), float32] span=StatefulPartitionedCall/pump_predictive_model_1/mode_1/MatMul:0:0 */;
  %54 = add(%53, meta[relay.Constant][25] /* ty=Tensor[(16), float32] span=StatefulPartitionedCall/pump_predictive_model_1/mode_1/BiasAdd.StatefulPartitionedCall/pump_predictive_model_1/mode_1/BiasAdd/ReadVariableOp:0:0:0 */) /* ty=Tensor[(1, 16), float32] span=StatefulPartitionedCall/pump_predictive_model_1/mode_1/BiasAdd:0:0 */;
  %55 = nn.dense(%49, meta[relay.Constant][26] /* ty=Tensor[(64, 128), float32] span=StatefulPartitionedCall/pump_predictive_model_1/sev_dense_1/MatMul:0:0 */, units=None, out_dtype="float32") /* ty=Tensor[(1, 64), float32] span=StatefulPartitionedCall/pump_predictive_model_1/sev_dense_1/MatMul:0:0 */;
  %56 = add(%55, meta[relay.Constant][27] /* ty=Tensor[(64), float32] span=StatefulPartitionedCall/pump_predictive_model_1/sev_dense_1/BiasAdd.StatefulPartitionedCall/pump_predictive_model_1/sev_dense_1/BiasAdd/ReadVariableOp:0:0:0 */) /* ty=Tensor[(1, 64), float32] span=StatefulPartitionedCall/pump_predictive_model_1/sev_dense_1/BiasAdd:0:0 */;
  %57 = nn.relu(%56) /* ty=Tensor[(1, 64), float32] span=StatefulPartitionedCall/pump_predictive_model_1/sev_dense_1/Relu:0:0 */;
  %58 = nn.dense(%57, meta[relay.Constant][28] /* ty=Tensor[(4, 64), float32] span=StatefulPartitionedCall/pump_predictive_model_1/severity_1/MatMul:0:0 */, units=None, out_dtype="float32") /* ty=Tensor[(1, 4), float32] span=StatefulPartitionedCall/pump_predictive_model_1/severity_1/MatMul:0:0 */;
  %59 = add(%58, meta[relay.Constant][29] /* ty=Tensor[(4), float32] span=StatefulPartitionedCall/pump_predictive_model_1/severity_1/BiasAdd.StatefulPartitionedCall/pump_predictive_model_1/severity_1/BiasAdd/ReadVariableOp:0:0:0 */) /* ty=Tensor[(1, 4), float32] span=StatefulPartitionedCall/pump_predictive_model_1/severity_1/BiasAdd:0:0 */;
  %60 = nn.dense(%49, meta[relay.Constant][30] /* ty=Tensor[(64, 128), float32] span=StatefulPartitionedCall/pump_predictive_model_1/health_dense_1/MatMul:0:0 */, units=None, out_dtype="float32") /* ty=Tensor[(1, 64), float32] span=StatefulPartitionedCall/pump_predictive_model_1/health_dense_1/MatMul:0:0 */;
  %61 = add(%60, meta[relay.Constant][31] /* ty=Tensor[(64), float32] span=StatefulPartitionedCall/pump_predictive_model_1/health_dense_1/BiasAdd.StatefulPartitionedCall/pump_predictive_model_1/health_dense_1/BiasAdd/ReadVariableOp:0:0:0 */) /* ty=Tensor[(1, 64), float32] span=StatefulPartitionedCall/pump_predictive_model_1/health_dense_1/BiasAdd:0:0 */;
  %62 = nn.relu(%61) /* ty=Tensor[(1, 64), float32] span=StatefulPartitionedCall/pump_predictive_model_1/health_dense_1/Relu:0:0 */;
  %63 = nn.dense(%62, meta[relay.Constant][32] /* ty=Tensor[(1, 64), float32] span=StatefulPartitionedCall/pump_predictive_model_1/health_index_1/MatMul:0:0 */, units=None, out_dtype="float32") /* ty=Tensor[(1, 1), float32] span=StatefulPartitionedCall/pump_predictive_model_1/health_index_1/MatMul:0:0 */;
  %64 = add(%63, meta[relay.Constant][33] /* ty=Tensor[(1), float32] span=StatefulPartitionedCall/pump_predictive_model_1/health_index_1/Add.StatefulPartitionedCall/pump_predictive_model_1/health_index_1/Add/ReadVariableOp:0:0:0 */) /* ty=Tensor[(1, 1), float32] span=StatefulPartitionedCall/pump_predictive_model_1/health_index_1/Add:0:0 */;
  %65 = sigmoid(%64) /* ty=Tensor[(1, 1), float32] span=StatefulPartitionedCall/pump_predictive_model_1/health_index_1/Sigmoid:0:0 */;
  %66 = nn.dense(%49, meta[relay.Constant][34] /* ty=Tensor[(64, 128), float32] span=StatefulPartitionedCall/pump_predictive_model_1/rul_dense_1/MatMul:0:0 */, units=None, out_dtype="float32") /* ty=Tensor[(1, 64), float32] span=StatefulPartitionedCall/pump_predictive_model_1/rul_dense_1/MatMul:0:0 */;
  %67 = add(%66, meta[relay.Constant][35] /* ty=Tensor[(64), float32] span=StatefulPartitionedCall/pump_predictive_model_1/rul_dense_1/BiasAdd.StatefulPartitionedCall/pump_predictive_model_1/rul_dense_1/BiasAdd/ReadVariableOp:0:0:0 */) /* ty=Tensor[(1, 64), float32] span=StatefulPartitionedCall/pump_predictive_model_1/rul_dense_1/BiasAdd:0:0 */;
  %68 = nn.relu(%67) /* ty=Tensor[(1, 64), float32] span=StatefulPartitionedCall/pump_predictive_model_1/rul_dense_1/Relu:0:0 */;
  %69 = nn.dense(%68, meta[relay.Constant][36] /* ty=Tensor[(1, 64), float32] span=StatefulPartitionedCall/pump_predictive_model_1/rul_1/MatMul:0:0 */, units=None, out_dtype="float32") /* ty=Tensor[(1, 1), float32] span=StatefulPartitionedCall/pump_predictive_model_1/rul_1/MatMul:0:0 */;
  %70 = add(%69, meta[relay.Constant][37] /* ty=Tensor[(1), float32] span=StatefulPartitionedCall/pump_predictive_model_1/rul_1/Add.StatefulPartitionedCall/pump_predictive_model_1/rul_1/Add/ReadVariableOp:0:0:0 */) /* ty=Tensor[(1, 1), float32] span=StatefulPartitionedCall/pump_predictive_model_1/rul_1/Add:0:0 */;
  %71 = nn.softmax(%54, axis=1) /* ty=Tensor[(1, 16), float32] span=StatefulPartitionedCall/pump_predictive_model_1/mode_1/Softmax:0:0 */;
  %72 = nn.softmax(%59, axis=1) /* ty=Tensor[(1, 4), float32] span=StatefulPartitionedCall/pump_predictive_model_1/severity_1/Softmax:0:0 */;
  %73 = multiply(%65, 100f /* ty=float32 span=StatefulPartitionedCall/pump_predictive_model_1/health_scaled_1/mul.StatefulPartitionedCall/pump_predictive_model_1/health_scaled_1/mul/y:0:0:0 */) /* ty=Tensor[(1, 1), float32] span=StatefulPartitionedCall/pump_predictive_model_1/health_scaled_1/mul:0:0 */;
  %74 = nn.relu(%70) /* ty=Tensor[(1, 1), float32] span=StatefulPartitionedCall/pump_predictive_model_1/rul_1/Relu:0:0 */;
  (%71, %72, %73, %74) /* ty=(Tensor[(1, 16), float32], Tensor[(1, 4), float32], Tensor[(1, 1), float32], Tensor[(1, 1), float32]) */
}

